#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warnings:

- Deprecated Resource
  on modules/vertex-ai-workbench/main.tf line 49

To see the full warning notes, run Terraform without -compact-warnings.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.gcr.google_project_service.api["artifactregistry.googleapis.com"]: Refreshing state... [id=tbd-2024l-276747/artifactregistry.googleapis.com]
data.google_client_config.provider: Reading...
module.vpc.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/tbd-2024l-276747/global/networks/main-vpc]
module.data-pipelines.google_storage_bucket.tbd-data-bucket: Refreshing state... [id=tbd-2024l-276747-data]
module.data-pipelines.google_storage_bucket.tbd-code-bucket: Refreshing state... [id=tbd-2024l-276747-code]
data.google_client_config.provider: Read complete after 0s [id=projects/"tbd-2024l-276747"/regions/"europe-central2"/zones/<null>]
module.data-pipelines.google_storage_bucket_object.job-code["spark-job.py"]: Refreshing state... [id=tbd-2024l-276747-code-spark-job.py]
module.vpc.google_compute_firewall.fw-allow-ingress-from-iap: Refreshing state... [id=projects/tbd-2024l-276747/global/firewalls/fw-allow-ingress-iap]
module.vpc.google_compute_firewall.default-internal-allow-all: Refreshing state... [id=projects/tbd-2024l-276747/global/firewalls/default-internal-allow-all]
module.vpc.module.cloud-router.google_compute_router.router: Refreshing state... [id=projects/tbd-2024l-276747/regions/europe-west1/routers/nat-router]
module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"]: Refreshing state... [id=projects/tbd-2024l-276747/regions/europe-west1/subnetworks/subnet-01]
google_compute_firewall.allow-all-internal: Refreshing state... [id=projects/tbd-2024l-276747/global/firewalls/allow-all-internal]
module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"]: Refreshing state... [id=projects/tbd-2024l-276747/global/routes/egress-internet]
module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"]: Refreshing state... [id=tbd-2024l-276747/europe-west1/nat-router/nat-gateway]
module.composer.google_project_service.api["composer.googleapis.com"]: Refreshing state... [id=tbd-2024l-276747/composer.googleapis.com]
module.dataproc.google_project_service.dataproc: Refreshing state... [id=tbd-2024l-276747/dataproc.googleapis.com]
module.composer.google_service_account.tbd-composer-sa: Refreshing state... [id=projects/tbd-2024l-276747/serviceAccounts/tbd-2024l-276747-data@tbd-2024l-276747.iam.gserviceaccount.com]
module.composer.google_compute_subnetwork.composer-subnet: Refreshing state... [id=projects/tbd-2024l-276747/regions/europe-west1/subnetworks/composer-subnet-01]
module.composer.google_project_iam_member.composer-member: Refreshing state... [id=tbd-2024l-276747/roles/composer.worker/serviceAccount:tbd-2024l-276747-data@tbd-2024l-276747.iam.gserviceaccount.com]
module.composer.google_project_iam_member.dataproc-editor-iam: Refreshing state... [id=tbd-2024l-276747/roles/dataproc.editor/serviceAccount:tbd-2024l-276747-data@tbd-2024l-276747.iam.gserviceaccount.com]
module.composer.google_project_iam_member.dataproc-sa-user-iam: Refreshing state... [id=tbd-2024l-276747/roles/iam.serviceAccountUser/serviceAccount:tbd-2024l-276747-data@tbd-2024l-276747.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-data-bucket-iam-editor: Refreshing state... [id=b/tbd-2024l-276747-data/roles/storage.objectUser/serviceAccount:tbd-2024l-276747-data@tbd-2024l-276747.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-code-bucket-iam-viewer: Refreshing state... [id=b/tbd-2024l-276747-code/roles/storage.objectViewer/serviceAccount:tbd-2024l-276747-data@tbd-2024l-276747.iam.gserviceaccount.com]
module.gcr.google_artifact_registry_repository.registry: Refreshing state... [id=projects/tbd-2024l-276747/locations/europe/repositories/eu.gcr.io]
module.composer.module.composer.google_project_iam_member.composer_agent_service_account[0]: Refreshing state... [id=tbd-2024l-276747/roles/composer.ServiceAgentV2Ext/serviceAccount:service-704118541832@cloudcomposer-accounts.iam.gserviceaccount.com]
module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster: Refreshing state... [id=projects/tbd-2024l-276747/regions/europe-west1/clusters/tbd-cluster]
module.jupyter_docker_image.docker_image.jupyter: Refreshing state... [id=sha256:1d3c371219c03a1c177407401a9ab1d6dfb8bff72437af3df388db1b669918bbeu.gcr.io/tbd-2024l-276747/jupyter:3.6.3]
module.jupyter_docker_image.docker_registry_image.jupyterlab: Refreshing state... [id=sha256:2f28a306afaae457dbe2fe8d0d8940eb2434bfce1b303cc7ef8d4d1b98cc169d]
module.vertex_ai_workbench.google_project_service.notebooks: Refreshing state... [id=tbd-2024l-276747/notebooks.googleapis.com]
module.vertex_ai_workbench.google_project_iam_binding.token_creator_role: Refreshing state... [id=tbd-2024l-276747/roles/iam.serviceAccountTokenCreator]
module.vertex_ai_workbench.google_storage_bucket.notebook-conf-bucket: Refreshing state... [id=tbd-2024l-276747-conf]
module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding: Refreshing state... [id=b/tbd-2024l-276747-conf/roles/storage.objectViewer]
module.vertex_ai_workbench.google_storage_bucket_object.post-startup: Refreshing state... [id=tbd-2024l-276747-conf-scripts/notebook_post_startup_script.sh]
module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook: Refreshing state... [id=projects/tbd-2024l-276747/locations/europe-west1-b/instances/tbd-2024l-276747-notebook]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.jupyter_docker_image.docker_image.jupyter has been deleted
  - resource "docker_image" "jupyter" {
        id          = "sha256:1d3c371219c03a1c177407401a9ab1d6dfb8bff72437af3df388db1b669918bbeu.gcr.io/tbd-2024l-276747/jupyter:3.6.3"
      - name        = "eu.gcr.io/tbd-2024l-276747/jupyter:3.6.3" -> null
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_container_cluster.composer-gke-cluster will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_cluster" "composer-gke-cluster" {
      + addons_config                            = (known after apply)
      + allow_net_admin                          = (known after apply)
      + authenticator_groups_config              = (known after apply)
      + binary_authorization                     = (known after apply)
      + cluster_autoscaling                      = (known after apply)
      + cluster_ipv4_cidr                        = (known after apply)
      + confidential_nodes                       = (known after apply)
      + cost_management_config                   = (known after apply)
      + database_encryption                      = (known after apply)
      + datapath_provider                        = (known after apply)
      + default_max_pods_per_node                = (known after apply)
      + default_snat_status                      = (known after apply)
      + deletion_protection                      = (known after apply)
      + description                              = (known after apply)
      + dns_config                               = (known after apply)
      + enable_autopilot                         = (known after apply)
      + enable_cilium_clusterwide_network_policy = (known after apply)
      + enable_intranode_visibility              = (known after apply)
      + enable_k8s_beta_apis                     = (known after apply)
      + enable_kubernetes_alpha                  = (known after apply)
      + enable_l4_ilb_subsetting                 = (known after apply)
      + enable_legacy_abac                       = (known after apply)
      + enable_multi_networking                  = (known after apply)
      + enable_shielded_nodes                    = (known after apply)
      + enable_tpu                               = (known after apply)
      + endpoint                                 = (known after apply)
      + fleet                                    = (known after apply)
      + gateway_api_config                       = (known after apply)
      + id                                       = (known after apply)
      + identity_service_config                  = (known after apply)
      + initial_node_count                       = (known after apply)
      + ip_allocation_policy                     = (known after apply)
      + label_fingerprint                        = (known after apply)
      + location                                 = "europe-central2"
      + logging_config                           = (known after apply)
      + logging_service                          = (known after apply)
      + maintenance_policy                       = (known after apply)
      + master_auth                              = (known after apply)
      + master_authorized_networks_config        = (known after apply)
      + master_version                           = (known after apply)
      + mesh_certificates                        = (known after apply)
      + min_master_version                       = (known after apply)
      + monitoring_config                        = (known after apply)
      + monitoring_service                       = (known after apply)
      + name                                     = (known after apply)
      + network                                  = (known after apply)
      + network_policy                           = (known after apply)
      + networking_mode                          = (known after apply)
      + node_config                              = (known after apply)
      + node_locations                           = (known after apply)
      + node_pool                                = (known after apply)
      + node_pool_auto_config                    = (known after apply)
      + node_pool_defaults                       = (known after apply)
      + node_version                             = (known after apply)
      + notification_config                      = (known after apply)
      + operation                                = (known after apply)
      + private_cluster_config                   = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      + release_channel                          = (known after apply)
      + remove_default_node_pool                 = (known after apply)
      + resource_labels                          = (known after apply)
      + resource_usage_export_config             = (known after apply)
      + security_posture_config                  = (known after apply)
      + self_link                                = (known after apply)
      + service_external_ips_config              = (known after apply)
      + services_ipv4_cidr                       = (known after apply)
      + subnetwork                               = (known after apply)
      + tpu_ipv4_cidr_block                      = (known after apply)
      + vertical_pod_autoscaling                 = (known after apply)
      + workload_identity_config                 = (known after apply)
    }

  # kubernetes_service.dbt-task-service will be created
  + resource "kubernetes_service" "dbt-task-service" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "dbt-app"
            }
          + name             = "dbt-task-service"
          + namespace        = "composer-user-workloads"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "app" = "dbt-app"
            }
          + session_affinity                  = "None"
          + type                              = "NodePort"

          + port {
              + name        = "spark-driver"
              + node_port   = 30000
              + port        = 30000
              + protocol    = "TCP"
              + target_port = "30000"
            }
          + port {
              + name        = "spark-block-mgr"
              + node_port   = 30001
              + port        = 30001
              + protocol    = "TCP"
              + target_port = "30001"
            }

          + session_affinity_config (known after apply)
        }
    }

  # module.data-pipelines.google_storage_bucket.tbd-code-bucket must be replaced
-/+ resource "google_storage_bucket" "tbd-code-bucket" {
      - default_event_based_hold    = false -> null
      ~ effective_labels            = {} -> (known after apply)
      - enable_object_retention     = false -> null
      ~ id                          = "tbd-2024l-276747-code" -> (known after apply)
      - labels                      = {} -> null
      ~ location                    = "EUROPE-WEST1" -> "EUROPE-CENTRAL2" # forces replacement
        name                        = "tbd-2024l-276747-code"
      ~ project_number              = 704118541832 -> (known after apply)
      - requester_pays              = false -> null
      + rpo                         = (known after apply)
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/tbd-2024l-276747-code" -> (known after apply)
      ~ terraform_labels            = {} -> (known after apply)
      ~ url                         = "gs://tbd-2024l-276747-code" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ soft_delete_policy {
          + default_event_based_hold    = (known after apply)
          + effective_labels            = (known after apply)
          + enable_object_retention     = (known after apply)
          + force_destroy               = (known after apply)
          + id                          = (known after apply)
          + labels                      = (known after apply)
          + location                    = (known after apply)
          + name                        = (known after apply)
          + project                     = (known after apply)
          + project_number              = (known after apply)
          + public_access_prevention    = (known after apply)
          + requester_pays              = (known after apply)
          + rpo                         = (known after apply)
          + self_link                   = (known after apply)
          + storage_class               = (known after apply)
          + terraform_labels            = (known after apply)
          + uniform_bucket_level_access = (known after apply)
          + url                         = (known after apply)
        } -> (known after apply)

      ~ website {
          + default_event_based_hold    = (known after apply)
          + effective_labels            = (known after apply)
          + enable_object_retention     = (known after apply)
          + force_destroy               = (known after apply)
          + id                          = (known after apply)
          + labels                      = (known after apply)
          + location                    = (known after apply)
          + name                        = (known after apply)
          + project                     = (known after apply)
          + project_number              = (known after apply)
          + public_access_prevention    = (known after apply)
          + requester_pays              = (known after apply)
          + rpo                         = (known after apply)
          + self_link                   = (known after apply)
          + storage_class               = (known after apply)
          + terraform_labels            = (known after apply)
          + uniform_bucket_level_access = (known after apply)
          + url                         = (known after apply)
        } -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.data-pipelines.google_storage_bucket.tbd-data-bucket must be replaced
-/+ resource "google_storage_bucket" "tbd-data-bucket" {
      - default_event_based_hold    = false -> null
      ~ effective_labels            = {} -> (known after apply)
      - enable_object_retention     = false -> null
      ~ id                          = "tbd-2024l-276747-data" -> (known after apply)
      - labels                      = {} -> null
      ~ location                    = "EUROPE-WEST1" -> "EUROPE-CENTRAL2" # forces replacement
        name                        = "tbd-2024l-276747-data"
      ~ project_number              = 704118541832 -> (known after apply)
      - requester_pays              = false -> null
      + rpo                         = (known after apply)
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/tbd-2024l-276747-data" -> (known after apply)
      ~ terraform_labels            = {} -> (known after apply)
      ~ url                         = "gs://tbd-2024l-276747-data" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ soft_delete_policy {
          + default_event_based_hold    = (known after apply)
          + effective_labels            = (known after apply)
          + enable_object_retention     = (known after apply)
          + force_destroy               = (known after apply)
          + id                          = (known after apply)
          + labels                      = (known after apply)
          + location                    = (known after apply)
          + name                        = (known after apply)
          + project                     = (known after apply)
          + project_number              = (known after apply)
          + public_access_prevention    = (known after apply)
          + requester_pays              = (known after apply)
          + rpo                         = (known after apply)
          + self_link                   = (known after apply)
          + storage_class               = (known after apply)
          + terraform_labels            = (known after apply)
          + uniform_bucket_level_access = (known after apply)
          + url                         = (known after apply)
        } -> (known after apply)

      ~ website {
          + default_event_based_hold    = (known after apply)
          + effective_labels            = (known after apply)
          + enable_object_retention     = (known after apply)
          + force_destroy               = (known after apply)
          + id                          = (known after apply)
          + labels                      = (known after apply)
          + location                    = (known after apply)
          + name                        = (known after apply)
          + project                     = (known after apply)
          + project_number              = (known after apply)
          + public_access_prevention    = (known after apply)
          + requester_pays              = (known after apply)
          + rpo                         = (known after apply)
          + self_link                   = (known after apply)
          + storage_class               = (known after apply)
          + terraform_labels            = (known after apply)
          + uniform_bucket_level_access = (known after apply)
          + url                         = (known after apply)
        } -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.data-pipelines.google_storage_bucket_object.dag-code["data-dag.py"] will be created
  + resource "google_storage_bucket_object" "dag-code" {
      + bucket         = (known after apply)
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = (known after apply)
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "modules/data-pipeline/resources/data-dag.py"
      + storage_class  = (known after apply)
    }

  # module.data-pipelines.google_storage_bucket_object.dbt-dag-code["dbt-dag.py"] will be created
  + resource "google_storage_bucket_object" "dbt-dag-code" {
      + bucket         = (known after apply)
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = (known after apply)
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "modules/data-pipeline/resources/dbt-dag.py"
      + storage_class  = (known after apply)
    }

  # module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster must be replaced
-/+ resource "google_dataproc_cluster" "tbd-dataproc-cluster" {
      ~ effective_labels              = {
          - "goog-dataproc-autozone"     = "enabled"
          - "goog-dataproc-cluster-name" = "tbd-cluster"
          - "goog-dataproc-cluster-uuid" = "ee07b71a-15b0-4d4d-a1bf-e9eaafe92424"
          - "goog-dataproc-location"     = "europe-west1"
        } -> (known after apply)
      ~ id                            = "projects/tbd-2024l-276747/regions/europe-west1/clusters/tbd-cluster" -> (known after apply)
      - labels                        = {} -> null
        name                          = "tbd-cluster"
      ~ region                        = "europe-west1" -> "europe-central2" # forces replacement
      ~ terraform_labels              = {} -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ cluster_config {
          ~ bucket         = "dataproc-staging-europe-west1-704118541832-mwg9fiqd" -> (known after apply)
          ~ temp_bucket    = "dataproc-temp-europe-west1-704118541832-tmmxeqgl" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ auxiliary_node_groups {
              + bucket         = (known after apply)
              + staging_bucket = (known after apply)
              + temp_bucket    = (known after apply)
            } -> (known after apply)

          ~ dataproc_metric_config {
              + bucket         = (known after apply)
              + staging_bucket = (known after apply)
              + temp_bucket    = (known after apply)
            } -> (known after apply)

          ~ endpoint_config {
              ~ http_ports              = {
                  - "HDFS NameNode"             = "https://uaribhydzbgitd7lzvmidjhp7a-dot-europe-west1.dataproc.googleusercontent.com/hdfs/dfshealth.html"
                  - "MapReduce Job History"     = "https://uaribhydzbgitd7lzvmidjhp7a-dot-europe-west1.dataproc.googleusercontent.com/jobhistory/"
                  - "Spark History Server"      = "https://uaribhydzbgitd7lzvmidjhp7a-dot-europe-west1.dataproc.googleusercontent.com/sparkhistory/"
                  - "Tez"                       = "https://uaribhydzbgitd7lzvmidjhp7a-dot-europe-west1.dataproc.googleusercontent.com/apphistory/tez-ui/"
                  - "YARN Application Timeline" = "https://uaribhydzbgitd7lzvmidjhp7a-dot-europe-west1.dataproc.googleusercontent.com/apphistory/"
                  - "YARN ResourceManager"      = "https://uaribhydzbgitd7lzvmidjhp7a-dot-europe-west1.dataproc.googleusercontent.com/yarn/"
                } -> (known after apply)
                # (1 unchanged attribute hidden)
            }

          ~ gce_cluster_config {
              + network                = (known after apply)
              ~ service_account_scopes = [
                  - "https://www.googleapis.com/auth/cloud-platform",
                ] -> (known after apply)
              ~ subnetwork             = "https://www.googleapis.com/compute/v1/projects/tbd-2024l-276747/regions/europe-west1/subnetworks/subnet-01" # forces replacement -> (known after apply) # forces replacement
              - tags                   = [] -> null
              ~ zone                   = "europe-west1-d" -> (known after apply)
                # (3 unchanged attributes hidden)

              ~ node_group_affinity {
                  + internal_ip_only       = (known after apply)
                  + metadata               = (known after apply)
                  + network                = (known after apply)
                  + service_account        = (known after apply)
                  + service_account_scopes = (known after apply)
                  + subnetwork             = (known after apply)
                  + tags                   = (known after apply)
                  + zone                   = (known after apply)
                } -> (known after apply)

              ~ reservation_affinity {
                  + internal_ip_only       = (known after apply)
                  + metadata               = (known after apply)
                  + network                = (known after apply)
                  + service_account        = (known after apply)
                  + service_account_scopes = (known after apply)
                  + subnetwork             = (known after apply)
                  + tags                   = (known after apply)
                  + zone                   = (known after apply)
                } -> (known after apply)

              ~ shielded_instance_config {
                  + internal_ip_only       = (known after apply)
                  + metadata               = (known after apply)
                  + network                = (known after apply)
                  + service_account        = (known after apply)
                  + service_account_scopes = (known after apply)
                  + subnetwork             = (known after apply)
                  + tags                   = (known after apply)
                  + zone                   = (known after apply)
                } -> (known after apply)
            }

          ~ initialization_action {
              ~ script      = "gs://goog-dataproc-initialization-actions-europe-west1/python/pip-install.sh" -> "gs://goog-dataproc-initialization-actions-europe-central2/python/pip-install.sh" # forces replacement
                # (1 unchanged attribute hidden)
            }

          ~ master_config {
              ~ image_uri        = "https://www.googleapis.com/compute/v1/projects/cloud-dataproc/global/images/dataproc-2-1-ubu20-20231001-111635-rc01" -> (known after apply)
              ~ instance_names   = [
                  - "tbd-cluster-m",
                ] -> (known after apply)
              ~ min_cpu_platform = "AUTOMATIC" -> (known after apply)
                # (2 unchanged attributes hidden)

              ~ disk_config {
                  ~ num_local_ssds      = 0 -> (known after apply)
                    # (3 unchanged attributes hidden)
                }
            }

          ~ preemptible_worker_config {
              ~ instance_names = [] -> (known after apply)
                # (2 unchanged attributes hidden)

              ~ disk_config {
                  ~ num_local_ssds      = 0 -> (known after apply)
                    # (3 unchanged attributes hidden)
                }

              ~ instance_flexibility_policy {
                  + instance_names = (known after apply)
                  + num_instances  = (known after apply)
                  + preemptibility = (known after apply)
                } -> (known after apply)
            }

          ~ software_config {
              - optional_components = [] -> null
              - override_properties = {} -> null
              ~ properties          = {
                  - "capacity-scheduler:yarn.scheduler.capacity.root.default.ordering-policy"                 = "fair"
                  - "core:fs.gs.block.size"                                                                   = "134217728"
                  - "core:fs.gs.metadata.cache.enable"                                                        = "false"
                  - "core:hadoop.ssl.enabled.protocols"                                                       = "TLSv1,TLSv1.1,TLSv1.2"
                  - "distcp:mapreduce.map.java.opts"                                                          = "-Xmx768m"
                  - "distcp:mapreduce.map.memory.mb"                                                          = "1024"
                  - "distcp:mapreduce.reduce.java.opts"                                                       = "-Xmx768m"
                  - "distcp:mapreduce.reduce.memory.mb"                                                       = "1024"
                  - "hadoop-env:HADOOP_DATANODE_OPTS"                                                         = "-Xmx512m"
                  - "hdfs:dfs.datanode.address"                                                               = "0.0.0.0:9866"
                  - "hdfs:dfs.datanode.http.address"                                                          = "0.0.0.0:9864"
                  - "hdfs:dfs.datanode.https.address"                                                         = "0.0.0.0:9865"
                  - "hdfs:dfs.datanode.ipc.address"                                                           = "0.0.0.0:9867"
                  - "hdfs:dfs.namenode.handler.count"                                                         = "20"
                  - "hdfs:dfs.namenode.http-address"                                                          = "0.0.0.0:9870"
                  - "hdfs:dfs.namenode.https-address"                                                         = "0.0.0.0:9871"
                  - "hdfs:dfs.namenode.lifeline.rpc-address"                                                  = "tbd-cluster-m:8050"
                  - "hdfs:dfs.namenode.secondary.http-address"                                                = "0.0.0.0:9868"
                  - "hdfs:dfs.namenode.secondary.https-address"                                               = "0.0.0.0:9869"
                  - "hdfs:dfs.namenode.service.handler.count"                                                 = "10"
                  - "hdfs:dfs.namenode.servicerpc-address"                                                    = "tbd-cluster-m:8051"
                  - "mapred-env:HADOOP_JOB_HISTORYSERVER_HEAPSIZE"                                            = "4000"
                  - "mapred:mapreduce.job.maps"                                                               = "21"
                  - "mapred:mapreduce.job.reduce.slowstart.completedmaps"                                     = "0.95"
                  - "mapred:mapreduce.job.reduces"                                                            = "7"
                  - "mapred:mapreduce.jobhistory.recovery.store.class"                                        = "org.apache.hadoop.mapreduce.v2.hs.HistoryServerLeveldbStateStoreService"
                  - "mapred:mapreduce.map.cpu.vcores"                                                         = "1"
                  - "mapred:mapreduce.map.java.opts"                                                          = "-Xmx2708m"
                  - "mapred:mapreduce.map.memory.mb"                                                          = "3386"
                  - "mapred:mapreduce.reduce.cpu.vcores"                                                      = "1"
                  - "mapred:mapreduce.reduce.java.opts"                                                       = "-Xmx2708m"
                  - "mapred:mapreduce.reduce.memory.mb"                                                       = "3386"
                  - "mapred:mapreduce.task.io.sort.mb"                                                        = "256"
                  - "mapred:yarn.app.mapreduce.am.command-opts"                                               = "-Xmx2708m"
                  - "mapred:yarn.app.mapreduce.am.resource.cpu-vcores"                                        = "1"
                  - "mapred:yarn.app.mapreduce.am.resource.mb"                                                = "3386"
                  - "spark-env:SPARK_DAEMON_MEMORY"                                                           = "4000m"
                  - "spark:spark.driver.maxResultSize"                                                        = "2048m"
                  - "spark:spark.driver.memory"                                                               = "4096m"
                  - "spark:spark.executor.cores"                                                              = "2"
                  - "spark:spark.executor.instances"                                                          = "2"
                  - "spark:spark.executor.memory"                                                             = "6157m"
                  - "spark:spark.executorEnv.OPENBLAS_NUM_THREADS"                                            = "1"
                  - "spark:spark.scheduler.mode"                                                              = "FAIR"
                  - "spark:spark.sql.cbo.enabled"                                                             = "true"
                  - "spark:spark.ui.port"                                                                     = "0"
                  - "spark:spark.yarn.am.memory"                                                              = "640m"
                  - "yarn-env:YARN_NODEMANAGER_HEAPSIZE"                                                      = "1638"
                  - "yarn-env:YARN_RESOURCEMANAGER_HEAPSIZE"                                                  = "4000"
                  - "yarn-env:YARN_TIMELINESERVER_HEAPSIZE"                                                   = "4000"
                  - "yarn:yarn.nodemanager.address"                                                           = "0.0.0.0:8026"
                  - "yarn:yarn.nodemanager.resource.cpu-vcores"                                               = "4"
                  - "yarn:yarn.nodemanager.resource.memory-mb"                                                = "13544"
                  - "yarn:yarn.resourcemanager.decommissioning-nodes-watcher.decommission-if-no-shuffle-data" = "true"
                  - "yarn:yarn.resourcemanager.nodemanager-graceful-decommission-timeout-secs"                = "86400"
                  - "yarn:yarn.scheduler.maximum-allocation-mb"                                               = "13544"
                  - "yarn:yarn.scheduler.minimum-allocation-mb"                                               = "1"
                } -> (known after apply)
                # (1 unchanged attribute hidden)
            }

          ~ worker_config {
              ~ image_uri         = "https://www.googleapis.com/compute/v1/projects/cloud-dataproc/global/images/dataproc-2-1-ubu20-20231001-111635-rc01" -> (known after apply)
              ~ instance_names    = [
                  - "tbd-cluster-w-0",
                  - "tbd-cluster-w-1",
                ] -> (known after apply)
              ~ min_cpu_platform  = "AUTOMATIC" -> (known after apply)
              ~ min_num_instances = 0 -> (known after apply)
                # (2 unchanged attributes hidden)

              ~ disk_config {
                  ~ num_local_ssds      = 0 -> (known after apply)
                    # (3 unchanged attributes hidden)
                }
            }
        }

      ~ virtual_cluster_config {
          + effective_labels              = (known after apply)
          + graceful_decommission_timeout = (known after apply)
          + id                            = (known after apply)
          + labels                        = (known after apply)
          + name                          = (known after apply)
          + project                       = (known after apply)
          + region                        = (known after apply)
          + terraform_labels              = (known after apply)
        } -> (known after apply)
    }

  # module.dbt_docker_image.docker_image.dbt will be created
  + resource "docker_image" "dbt" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2024l-276747/dbt:1.7.13"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "16d9a47a192d8b357f5d8b2ba5b77c3a61503388"
        }

      + build {
          + build_args     = {
              + "DBT_SPARK_VERSION" = "1.7.1"
              + "DBT_VERSION"       = "1.7.13"
              + "PROJECT_NAME"      = "tbd-2024l-276747"
              + "SPARK_VERSION"     = "3.3.2"
            }
          + cache_from     = []
          + context        = "modules/dbt_docker_image/resources"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "amd64"
          + remove         = true
          + security_opt   = []
          + tag            = [
              + "eu.gcr.io/tbd-2024l-276747/dbt:latest",
            ]
            # (10 unchanged attributes hidden)
        }
    }

  # module.dbt_docker_image.docker_registry_image.dbt will be created
  + resource "docker_registry_image" "dbt" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = "eu.gcr.io/tbd-2024l-276747/dbt:1.7.13"
      + sha256_digest        = (known after apply)
      + triggers             = {
          + "dir_sha1" = "16d9a47a192d8b357f5d8b2ba5b77c3a61503388"
        }
    }

  # module.jupyter_docker_image.docker_image.jupyter will be created
  + resource "docker_image" "jupyter" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2024l-276747/jupyter:3.6.3"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "0ae070775d3102ba9dae4391e78e62e46185e752"
        }

      + build {
          + build_args     = {
              + "DBT_SPARK_VERSION"     = "1.7.1"
              + "DBT_VERSION"           = "1.7.13"
              + "GCS_CONNECTOR_VERSION" = "2.2.17"
              + "JUPYTERLAB_VERSION"    = "3.6.3"
              + "PROJECT_NAME"          = "tbd-2024l-276747"
              + "SPARK_VERSION"         = "3.3.2"
            }
          + cache_from     = []
          + context        = "modules/jupyter_docker_image/resources"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "amd64"
          + remove         = true
          + security_opt   = []
          + tag            = [
              + "eu.gcr.io/tbd-2024l-276747/jupyter:latest",
            ]
            # (10 unchanged attributes hidden)
        }
    }

  # module.vertex_ai_workbench.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + deletion_policy     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "tbd-2024l-276747"
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook must be replaced
-/+ resource "google_notebooks_instance" "tbd_notebook" {
      ~ create_time            = "2025-01-12T14:36:15.892099529Z" -> (known after apply)
      ~ disk_encryption        = "GMEK" -> (known after apply)
      ~ effective_labels       = {
          - "goog-caip-notebook" = null
        } -> (known after apply)
      ~ id                     = "projects/tbd-2024l-276747/locations/europe-west1-b/instances/tbd-2024l-276747-notebook" -> (known after apply)
      - install_gpu_driver     = false -> null
      - labels                 = {} -> null
      ~ location               = "europe-west1-b" -> "europe-central2-b" # forces replacement
        name                   = "tbd-2024l-276747-notebook"
      ~ network                = "https://www.googleapis.com/compute/v1/projects/tbd-2024l-276747/global/networks/main-vpc" -> "projects/tbd-2024l-276747/global/networks/main-vpc"
      + proxy_uri              = (known after apply)
      ~ service_account        = "704118541832-compute@developer.gserviceaccount.com" -> (known after apply)
      ~ service_account_scopes = [
          - "https://www.googleapis.com/auth/cloud-platform",
          - "https://www.googleapis.com/auth/userinfo.email",
        ] -> (known after apply)
      ~ state                  = "ACTIVE" -> (known after apply)
      ~ subnet                 = "https://www.googleapis.com/compute/v1/projects/tbd-2024l-276747/regions/europe-west1/subnetworks/subnet-01" # forces replacement -> (known after apply) # forces replacement
      ~ tags                   = [
          - "deeplearning-vm",
          - "notebook-instance",
        ] -> (known after apply)
      ~ terraform_labels       = {} -> (known after apply)
      ~ update_time            = "2025-01-12T14:40:36.997215732Z" -> (known after apply)
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.vertex_ai_workbench.google_project_iam_binding.token_creator_role will be updated in-place
  ~ resource "google_project_iam_binding" "token_creator_role" {
        id      = "tbd-2024l-276747/roles/iam.serviceAccountTokenCreator"
      ~ members = [
          - "serviceAccount:704118541832-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.vertex_ai_workbench.google_storage_bucket.notebook-conf-bucket must be replaced
-/+ resource "google_storage_bucket" "notebook-conf-bucket" {
      - default_event_based_hold    = false -> null
      ~ effective_labels            = {} -> (known after apply)
      - enable_object_retention     = false -> null
      ~ id                          = "tbd-2024l-276747-conf" -> (known after apply)
      - labels                      = {} -> null
      ~ location                    = "EUROPE-WEST1" -> "EUROPE-CENTRAL2" # forces replacement
        name                        = "tbd-2024l-276747-conf"
      ~ project                     = "tbd-2024l-276747" -> (known after apply)
      ~ project_number              = 704118541832 -> (known after apply)
      - requester_pays              = false -> null
      + rpo                         = (known after apply)
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/tbd-2024l-276747-conf" -> (known after apply)
      ~ terraform_labels            = {} -> (known after apply)
      ~ url                         = "gs://tbd-2024l-276747-conf" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ soft_delete_policy {
          + default_event_based_hold    = (known after apply)
          + effective_labels            = (known after apply)
          + enable_object_retention     = (known after apply)
          + force_destroy               = (known after apply)
          + id                          = (known after apply)
          + labels                      = (known after apply)
          + location                    = (known after apply)
          + name                        = (known after apply)
          + project                     = (known after apply)
          + project_number              = (known after apply)
          + public_access_prevention    = (known after apply)
          + requester_pays              = (known after apply)
          + rpo                         = (known after apply)
          + self_link                   = (known after apply)
          + storage_class               = (known after apply)
          + terraform_labels            = (known after apply)
          + uniform_bucket_level_access = (known after apply)
          + url                         = (known after apply)
        } -> (known after apply)

      ~ website {
          + default_event_based_hold    = (known after apply)
          + effective_labels            = (known after apply)
          + enable_object_retention     = (known after apply)
          + force_destroy               = (known after apply)
          + id                          = (known after apply)
          + labels                      = (known after apply)
          + location                    = (known after apply)
          + name                        = (known after apply)
          + project                     = (known after apply)
          + project_number              = (known after apply)
          + public_access_prevention    = (known after apply)
          + requester_pays              = (known after apply)
          + rpo                         = (known after apply)
          + self_link                   = (known after apply)
          + storage_class               = (known after apply)
          + terraform_labels            = (known after apply)
          + uniform_bucket_level_access = (known after apply)
          + url                         = (known after apply)
        } -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding will be updated in-place
  ~ resource "google_storage_bucket_iam_binding" "binding" {
        id      = "b/tbd-2024l-276747-conf/roles/storage.objectViewer"
      ~ members = [
          - "serviceAccount:704118541832-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.composer.module.composer.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + deletion_policy     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "tbd-2024l-276747"
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.composer.module.composer.google_composer_environment.composer_env will be created
  + resource "google_composer_environment" "composer_env" {
      + effective_labels = (known after apply)
      + id               = (known after apply)
      + name             = "demo-lab"
      + project          = "tbd-2024l-276747"
      + region           = "europe-west1"
      + terraform_labels = (known after apply)

      + config {
          + airflow_uri                = (known after apply)
          + dag_gcs_prefix             = (known after apply)
          + enable_private_builds_only = (known after apply)
          + enable_private_environment = (known after apply)
          + environment_size           = "ENVIRONMENT_SIZE_SMALL"
          + gke_cluster                = (known after apply)
          + node_count                 = (known after apply)
          + resilience_mode            = (known after apply)

          + data_retention_config (known after apply)

          + database_config (known after apply)

          + encryption_config (known after apply)

          + maintenance_window (known after apply)

          + node_config {
              + composer_internal_ipv4_cidr_block = (known after apply)
              + composer_network_attachment       = (known after apply)
              + disk_size_gb                      = (known after apply)
              + enable_ip_masq_agent              = false
              + ip_allocation_policy              = (known after apply)
              + machine_type                      = (known after apply)
              + max_pods_per_node                 = (known after apply)
              + network                           = "projects/tbd-2024l-276747/global/networks/main-vpc"
              + oauth_scopes                      = (known after apply)
              + service_account                   = "tbd-2024l-276747-data@tbd-2024l-276747.iam.gserviceaccount.com"
              + subnetwork                        = "projects/tbd-2024l-276747/regions/europe-west1/subnetworks/composer-subnet-01"
              + zone                              = (known after apply)
            }

          + private_environment_config (known after apply)

          + software_config {
              + env_variables           = {
                  + "AIRFLOW_VAR_BUCKET_NAME"         = "tbd-2024l-276747-code"
                  + "AIRFLOW_VAR_DBT_GIT_REPO"        = "https://github.com/pmalesa/tbd-tpc-di.git"
                  + "AIRFLOW_VAR_DBT_GIT_REPO_BRANCH" = "main"
                  + "AIRFLOW_VAR_PHS_CLUSTER"         = "tbd-cluster"
                  + "AIRFLOW_VAR_PROJECT_ID"          = "tbd-2024l-276747"
                  + "AIRFLOW_VAR_REGION_NAME"         = "europe-central2"
                  + "AIRFLOW_VAR_WRK_NAMESPACE"       = "composer-user-workloads"
                }
              + image_version           = "composer-2.6.1-airflow-2.5.3"
              + python_version          = (known after apply)
              + scheduler_count         = (known after apply)
              + web_server_plugins_mode = (known after apply)

              + cloud_data_lineage_integration (known after apply)
            }

          + web_server_config (known after apply)

          + web_server_network_access_control (known after apply)

          + workloads_config {
              + dag_processor (known after apply)
              + scheduler {
                  + count      = 1
                  + cpu        = 0.5
                  + memory_gb  = 1.875
                  + storage_gb = 1
                }
              + triggerer (known after apply)
              + web_server {
                  + cpu        = 0.5
                  + memory_gb  = 1.875
                  + storage_gb = 1
                }
              + worker {
                  + cpu        = 0.5
                  + max_count  = 3
                  + memory_gb  = 1.875
                  + min_count  = 1
                  + storage_gb = 1
                }
            }
        }

      + storage_config (known after apply)
    }

  # module.composer.module.composer.google_project_iam_member.composer_agent_service_account[0] must be replaced
-/+ resource "google_project_iam_member" "composer_agent_service_account" {
      ~ etag    = "BwYrg0AAzCM=" -> (known after apply)
      ~ id      = "tbd-2024l-276747/roles/composer.ServiceAgentV2Ext/serviceAccount:service-704118541832@cloudcomposer-accounts.iam.gserviceaccount.com" -> (known after apply)
      ~ member  = "serviceAccount:service-704118541832@cloudcomposer-accounts.iam.gserviceaccount.com" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.vpc.module.cloud-router.google_compute_router.router must be replaced
-/+ resource "google_compute_router" "router" {
      ~ creation_timestamp            = "2025-01-12T06:30:19.831-08:00" -> (known after apply)
      - encrypted_interconnect_router = false -> null
      ~ id                            = "projects/tbd-2024l-276747/regions/europe-west1/routers/nat-router" -> (known after apply)
        name                          = "nat-router"
      ~ network                       = "https://www.googleapis.com/compute/v1/projects/tbd-2024l-276747/global/networks/main-vpc" -> "projects/tbd-2024l-276747/global/networks/main-vpc"
      ~ region                        = "europe-west1" -> "europe-central2" # forces replacement
      ~ self_link                     = "https://www.googleapis.com/compute/v1/projects/tbd-2024l-276747/regions/europe-west1/routers/nat-router" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"] must be replaced
-/+ resource "google_compute_router_nat" "nats" {
      ~ auto_network_tier                   = "PREMIUM" -> (known after apply)
      - drain_nat_ips                       = [] -> null
      ~ enable_dynamic_port_allocation      = false -> (known after apply)
      ~ enable_endpoint_independent_mapping = false -> (known after apply)
      ~ endpoint_types                      = [
          - "ENDPOINT_TYPE_VM",
        ] -> (known after apply)
      ~ id                                  = "tbd-2024l-276747/europe-west1/nat-router/nat-gateway" -> (known after apply)
      - max_ports_per_vm                    = 0 -> null
      ~ min_ports_per_vm                    = 0 -> (known after apply)
        name                                = "nat-gateway"
      - nat_ips                             = [] -> null
      ~ region                              = "europe-west1" -> "europe-central2" # forces replacement
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-central2/subnet-01"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.10.10.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "subnet-01"
      + network                    = "main-vpc"
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "tbd-2024l-276747"
      + purpose                    = (known after apply)
      + region                     = "europe-central2"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"] will be destroyed
  # (because key ["europe-west1/subnet-01"] is not in for_each map)
  - resource "google_compute_subnetwork" "subnetwork" {
      - creation_timestamp         = "2025-01-12T06:30:20.451-08:00" -> null
      - gateway_address            = "10.10.10.1" -> null
      - id                         = "projects/tbd-2024l-276747/regions/europe-west1/subnetworks/subnet-01" -> null
      - ip_cidr_range              = "10.10.10.0/24" -> null
      - name                       = "subnet-01" -> null
      - network                    = "https://www.googleapis.com/compute/v1/projects/tbd-2024l-276747/global/networks/main-vpc" -> null
      - private_ip_google_access   = true -> null
      - private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> null
      - project                    = "tbd-2024l-276747" -> null
      - purpose                    = "PRIVATE" -> null
      - region                     = "europe-west1" -> null
      - secondary_ip_range         = [] -> null
      - self_link                  = "https://www.googleapis.com/compute/v1/projects/tbd-2024l-276747/regions/europe-west1/subnetworks/subnet-01" -> null
      - stack_type                 = "IPV4_ONLY" -> null
        # (6 unchanged attributes hidden)
    }

Plan: 16 to add, 2 to change, 9 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Deprecated Resource

  with module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook,
  on modules/vertex-ai-workbench/main.tf line 49, in resource "google_notebooks_instance" "tbd_notebook":
  49: resource "google_notebooks_instance" "tbd_notebook" {

`google_notebook_instance` is deprecated and will be removed in a future
major release. Use `google_workbench_instance` instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @pmalesa, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*